### import numpy and pandas

In [1]:
import numpy as np
import pandas as pd

### load csv files

In [2]:
df = pd.read_csv('grades.csv')
df1 = pd.read_csv('match.csv')

### View first 5 Raw

In [3]:
df.head()

      filename  StudentID  Mark
0  Img0001.png       6061    37
1  Img0002.png       7248    34
2  Img0003.png       8751    30
3  Img0004.png       5613    29
4  Img0005.png       5098    25

In [4]:
df1.head()

,Student Code,Name,Program,grp,sec,Hall
0,18P9516,Hassan Walid Ahmed Mohamed Kaddah,BLDG,1,1,A
1,18P2158,Seif Muhammad Abdelwahab Yakout Elkhodary,BLDG,1,1,A
2,18P2286,Ahmed Essam Eldin Ahmed Kotb Elshafie,CESS,1,1,A
3,18P1241,Aliaa Abd El Karim Bastawy,CESS,1,1,A
4,18P1121,Hager Khaled Mohamed Karkar,CESS,1,1,A

### Check if any ID Equal Zero

In [5]:
df[df['StudentID'] == 0]

        filename  StudentID  Mark
135  Img0008.png          0    27
624  Img0121.png          0    27

### Check if any Mark Equal Zero

In [6]:
df[df['Mark'] == 0]

Empty DataFrame
Columns: [filename, StudentID, Mark]
Index: []

### Check if there is any duplicates  StudentID

In [7]:
df[df.duplicated(['StudentID']) == True].head()

        filename  StudentID  Mark
604  Img0101.png       8600    34
605  Img0102.png       3138    26
606  Img0103.png       9183    20
607  Img0104.png       8693    33
608  Img0105.png       8171    35

### Store non duplicates data in new variable

In [8]:
newDF = df[df.duplicated(['StudentID']) == False]

In [9]:
newDF.head()

      filename  StudentID  Mark
0  Img0001.png       6061    37
1  Img0002.png       7248    34
2  Img0003.png       8751    30
3  Img0004.png       5613    29
4  Img0005.png       5098    25

### Save cleaned data in new csv file

In [10]:
newDF.to_csv('cleaned_grades.csv')

### Remove first 3 index in StudentID and convert it to int

In [11]:
df1['StudentID'] = df1['Student Code'].str[3:].astype(int)
type(df1['StudentID'].iloc[0])

numpy.int64

### Dropout "Student Code" column

In [12]:
df1.drop(['Student Code'], axis=1, inplace=True)
df1.head()

                                        Name Program  grp  sec Hall  StudentID
0          Hassan Walid Ahmed Mohamed Kaddah    BLDG    1    1    A       9516
1  Seif Muhammad Abdelwahab Yakout Elkhodary    BLDG    1    1    A       2158
2      Ahmed Essam Eldin Ahmed Kotb Elshafie    CESS    1    1    A       2286
3                Aliaa Abd El Karim Bastawy     CESS    1    1    A       1241
4                Hager Khaled Mohamed Karkar    CESS    1    1    A       1121

### Get a statistics info about data

In [13]:
newDF['Mark'].describe()

count    604.000000
mean      29.698675
std        4.658692
min        8.000000
25%       27.000000
50%       30.000000
75%       33.000000
max       38.000000
Name: Mark, dtype: float64

### Create a new Column to assign it with Midterm Grade (Option #1)

In [ ]:
df1['Midterm_Grade'] = 0

### View the dataframe after modification

In [ ]:
df1.head()

In [ ]:
cnt = 0
for df1_index, df1_row in df1.iterrows():
    for newDF_index, newDF_row in newDF.iterrows():
        if newDF_row['StudentID'] == df1_row['StudentID']:
            df1.set_value(df1_index,df1_row['Midterm_Grade'],newDF_row['Mark'])
#             print(df1_row['Name'],'\t',df1_row['StudentID'],"\t",newDF_row['Mark'])
            cnt = cnt + 1
print('Number of Success Matching',cnt)

### Rename Column 0 with Midterm_Grade

In [ ]:
df1.drop(['Midterm_Grade'], axis=1, inplace=True)
df1.rename(columns={0: 'Midterm_Grade'}, inplace=True)
df1.head()

### Check for ungraded Student

In [ ]:
df1['Midterm_Grade'].isnull().sum()

In [ ]:
df1[df1['Midterm_Grade'].isnull()]

### Check Name

In [ ]:
print('Name: ',df1['Name'].iloc[173])
print('ID: ',df1['StudentID'].iloc[173])
print('Grade: ',df1['Midterm_Grade'].iloc[173])

### Save result data in new csv file

In [ ]:
df1.to_csv('result_option1.csv')

### Create a new Column to assign it with Midterm Grade (Option #2)

In [ ]:
final = pd.merge(newDF, df1, on='StudentID')

In [ ]:
final.head()

In [ ]:
final.drop('filename', axis=1, inplace=True)

In [ ]:
final['Mark'].describe()

In [ ]:
final['Mark'].count()

### Save result data in new csv file

In [ ]:
final.to_csv('result_option2.csv')

### Create a new Column to assign it with Midterm Grade (Option #3)

In [14]:
finalOne = pd.merge(newDF, df1, on='StudentID', how='outer')

In [15]:
finalOne.head()

,filename,StudentID,Mark,Name,Program,grp,sec,Hall
0,Img0001.png,6061,37.0,Muhab Khaled Muhammed Farid Elkalyoubi,CESS,8.0,1.0,A
1,Img0002.png,7248,34.0,Foraya Hany Mahmoud Ahmed Ali Mazroa,ENVR,8.0,1.0,A
2,Img0003.png,8751,30.0,Mahmoud Gad Mohamed Gad Abdelmoteleb,ENVR,8.0,1.0,A
3,Img0004.png,5613,29.0,Ali Mohamed Abdel-Aziz Saleh El-Halaby,MCTA,8.0,1.0,A
4,Img0005.png,5098,25.0,Sohaila Tarek Hassan Abdel Salam,COMM,8.0,1.0,A

### Verify that to duplicated StudentID

In [16]:
finalOne[finalOne.duplicated(['StudentID']) == True]

Empty DataFrame
Columns: [filename, StudentID, Mark, Name, Program, grp, sec, Hall]
Index: []

### Save result data in new csv file

In [17]:
finalOne.to_csv('result_option3.csv')